# **Week 4 Solutions**

### Please have a good hard go at your challenge questions before looking through these solutions.

### Here is a bit of motivation cat for you to give those challenges your best shot.

## **You've got this!**

![motivation-cat](../resources/images/MotivationCat.png)

In [1]:
%run test/week4_test.ipynb

# **Challenge Task 1: Data Cleaning Example**

You have been given some data below that contains fake information about employees at a random company. Your task is to perform the following data cleaning steps:

- Identify and handle missing values in the dataset. Think about the best way to do this
- Remove any duplicate records from the dataset.
- Display the cleaned DataFrame.

The goal is to apply the data cleaning techniques learned in the notebook to ensure the dataset is ready for further analysis.

In [4]:
# First 5 rows of the dataframe for challenge 1. Make sure you have run the first command of this notebook for this to work

challenge_1_df.head()

   ID     Name   Age   Salary       Role OfficeLocation
0   1    Alice  28.0  60000.0   Engineer       New York
1   2      Bob  35.0  75000.0    Manager  San Francisco
2   3  Charlie   NaN  80000.0    Analyst    Los Angeles
3   4    David  32.0  90000.0   Director        Chicago
4   5      Eva  28.0  70000.0  Assistant         Boston

In [5]:
print("Count of missing values: \n", challenge_1_df.isnull().sum())

print("\n Duplicate rows: \n", challenge_1_df.duplicated())

Count of missing values:
 ID                0
Name              0
Age               4
Salary            3
Role              1
OfficeLocation    2
dtype: int64

 Duplicate rows:
 0     False
1     False
2     False
3     False
4     False
5      True
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16    False
dtype: bool

### NOTE
Based on the above analysis, first we will drop the 1 duplicate row, before addressing the missing values.

For the missing values, I am going to drop the rows where there are missing values in the string columns (role & location), and then calculate the column means to fill in the missing values of the numerical columns (age & salary).

In your analysis, you may have chosen to address the missing values in a different way. In the real world, as long as you are able to justify your choice based on the analysis you need to conduct, generally, any approach is ok

In [6]:
challenge_1_df = challenge_1_df.drop_duplicates()
challenge_1_df

    ID     Name   Age   Salary       Role OfficeLocation
0    1    Alice  28.0  60000.0   Engineer       New York
1    2      Bob  35.0  75000.0    Manager  San Francisco
2    3  Charlie   NaN  80000.0    Analyst    Los Angeles
3    4    David  32.0  90000.0   Director        Chicago
4    5      Eva  28.0  70000.0  Assistant         Boston
6    6    Frank  45.0      NaN       None  San Francisco
7    7    Grace  38.0  80000.0    Analyst    Los Angeles
8    8    Henry   NaN  75000.0   Director           None
9    9      Ivy  29.0  65000.0  Assistant         Boston
10  10     Jack  34.0      NaN    Manager  San Francisco
11   2      Bob   NaN  72000.0    Manager  San Francisco
12  11    Alice  28.0  60000.0   Engineer       New York
13  12     Liam  26.0  85000.0   Engineer       New York
14  13      Mia   NaN      NaN    Manager           None
15  14     Noah  31.0  92000.0   Director        Chicago
16  15   Olivia  27.0  88000.0    Analyst         Boston

In [7]:
challenge_1_df = challenge_1_df.dropna(subset=['Role', 'OfficeLocation'])
challenge_1_df

    ID     Name   Age   Salary       Role OfficeLocation
0    1    Alice  28.0  60000.0   Engineer       New York
1    2      Bob  35.0  75000.0    Manager  San Francisco
2    3  Charlie   NaN  80000.0    Analyst    Los Angeles
3    4    David  32.0  90000.0   Director        Chicago
4    5      Eva  28.0  70000.0  Assistant         Boston
7    7    Grace  38.0  80000.0    Analyst    Los Angeles
9    9      Ivy  29.0  65000.0  Assistant         Boston
10  10     Jack  34.0      NaN    Manager  San Francisco
11   2      Bob   NaN  72000.0    Manager  San Francisco
12  11    Alice  28.0  60000.0   Engineer       New York
13  12     Liam  26.0  85000.0   Engineer       New York
15  14     Noah  31.0  92000.0   Director        Chicago
16  15   Olivia  27.0  88000.0    Analyst         Boston

In [8]:
challenge_1_df.loc[:,'Age'] = challenge_1_df['Age'].fillna(challenge_1_df['Age'].mean())
challenge_1_df.loc[:,'Salary'] = challenge_1_df['Salary'].fillna(challenge_1_df['Salary'].mean())
challenge_1_df

    ID     Name        Age        Salary       Role OfficeLocation
0    1    Alice  28.000000  60000.000000   Engineer       New York
1    2      Bob  35.000000  75000.000000    Manager  San Francisco
2    3  Charlie  30.545455  80000.000000    Analyst    Los Angeles
3    4    David  32.000000  90000.000000   Director        Chicago
4    5      Eva  28.000000  70000.000000  Assistant         Boston
7    7    Grace  38.000000  80000.000000    Analyst    Los Angeles
9    9      Ivy  29.000000  65000.000000  Assistant         Boston
10  10     Jack  34.000000  76416.666667    Manager  San Francisco
11   2      Bob  30.545455  72000.000000    Manager  San Francisco
12  11    Alice  28.000000  60000.000000   Engineer       New York
13  12     Liam  26.000000  85000.000000   Engineer       New York
15  14     Noah  31.000000  92000.000000   Director        Chicago
16  15   Olivia  27.000000  88000.000000    Analyst         Boston

In [9]:
# Check you have cleaned the dataset correctly

print("Count of missing values: \n", challenge_1_df.isnull().sum())

print("\n Duplicate rows: \n", challenge_1_df.duplicated())

Count of missing values:
 ID                0
Name              0
Age               0
Salary            0
Role              0
OfficeLocation    0
dtype: int64

 Duplicate rows:
 0     False
1     False
2     False
3     False
4     False
7     False
9     False
10    False
11    False
12    False
13    False
15    False
16    False
dtype: bool

In [10]:
# To tidy up the final dataset, we are going to change age to integer datatype & round the salary column to 2 decimal places, then display the final dataframe

challenge_1_df.loc[:,'Age'] = challenge_1_df['Age'].astype(int)
challenge_1_df = challenge_1_df.round({'Salary': 2})
challenge_1_df

    ID     Name   Age    Salary       Role OfficeLocation
0    1    Alice  28.0  60000.00   Engineer       New York
1    2      Bob  35.0  75000.00    Manager  San Francisco
2    3  Charlie  30.0  80000.00    Analyst    Los Angeles
3    4    David  32.0  90000.00   Director        Chicago
4    5      Eva  28.0  70000.00  Assistant         Boston
7    7    Grace  38.0  80000.00    Analyst    Los Angeles
9    9      Ivy  29.0  65000.00  Assistant         Boston
10  10     Jack  34.0  76416.67    Manager  San Francisco
11   2      Bob  30.0  72000.00    Manager  San Francisco
12  11    Alice  28.0  60000.00   Engineer       New York
13  12     Liam  26.0  85000.00   Engineer       New York
15  14     Noah  31.0  92000.00   Director        Chicago
16  15   Olivia  27.0  88000.00    Analyst         Boston

# **Challenge Task 2: Data Manipulation Example**
You have two datasets provided below. Your task is to perform the following data manipulation steps:

- Apply the following operations on each DataFrame:
  1. Select only columns which are relevant to an employee database.
  2. Address the missing values in the way you see most logical
  3. Join the two DataFrames using both the left join and inner join methods based on the 'ID' column (2 new dataframes will be created).
  4. Ensure the datatypes for each column are logically correct.
  5. Sort the DataFrame based on the 'Salary' column in descending order.
- Display the final result of both joined DataFrames.

In [11]:
# First 5 rows of the dataframe 1 for challenge 2. Make sure you have run the first command of this notebook for this to work

challenge_2_df_1.head()

   ID     Name   Age      Hobby  Salary
0   1    Alice  28.0    Reading   60000
1   2      Bob  35.0     Gaming   75000
2   3  Charlie  32.0   Painting   80000
3   4    David  45.0    Cooking   90000
4   5      Eva  28.0  Traveling   70000

In [12]:
# First 5 rows of the dataframe 2 for challenge 2. Make sure you have run the first command of this notebook for this to work

challenge_2_df_2.head()

   ID       Role   Pet FavoriteFood OfficeLocation
0   1   Engineer  None        Pizza       New York
1   2    Manager   Dog        Sushi  San Francisco
2   3    Analyst   Cat        Pasta    Los Angeles
3   4   Director  Fish       Burger        Chicago
4   5  Assistant  None        Salad         Boston

In [13]:
# STEP 1
challenge_2_df_1 = challenge_2_df_1[['ID', 'Name', 'Age', 'Salary']].copy()
challenge_2_df_2 = challenge_2_df_2[['ID', 'Role', 'OfficeLocation']].copy()

In [14]:
# Step 2
print("Missing values in df 1: \n", challenge_2_df_1.isnull().sum())
print("\n Missing values in df 2: \n", challenge_2_df_2.isnull().sum())

Missing values in df 1:
 ID        0
Name      0
Age       1
Salary    0
dtype: int64

 Missing values in df 2:
 ID                0
Role              0
OfficeLocation    1
dtype: int64

In [15]:
# Decision to address missing values for challenge 2: drop both rows

challenge_2_df_1 = challenge_2_df_1.dropna()
challenge_2_df_2 = challenge_2_df_2.dropna()

In [16]:
#STEP 3

left_join_df = challenge_2_df_1.merge(challenge_2_df_2, on="ID", how="left")
left_join_df

   ID     Name   Age  Salary       Role OfficeLocation
0   1    Alice  28.0   60000   Engineer       New York
1   2      Bob  35.0   75000    Manager  San Francisco
2   3  Charlie  32.0   80000    Analyst    Los Angeles
3   4    David  45.0   90000   Director        Chicago
4   5      Eva  28.0   70000  Assistant         Boston
5   6    Frank  45.0   85000        NaN            NaN
6   7    Grace  38.0   80000        NaN            NaN
7   9      Ivy  29.0   65000        NaN            NaN
8  10     Jack  34.0   72000        NaN            NaN

In [17]:
inner_join_df = challenge_2_df_1.merge(challenge_2_df_2, on="ID", how="inner")
inner_join_df

   ID     Name   Age  Salary       Role OfficeLocation
0   1    Alice  28.0   60000   Engineer       New York
1   2      Bob  35.0   75000    Manager  San Francisco
2   3  Charlie  32.0   80000    Analyst    Los Angeles
3   4    David  45.0   90000   Director        Chicago
4   5      Eva  28.0   70000  Assistant         Boston

In [18]:
#STEP 4

print("data types for left join df: \n", left_join_df.dtypes)
print("\n data types for inner join df: \n", inner_join_df.dtypes)

data types for left join df:
 ID                  int64
Name               object
Age               float64
Salary              int64
Role               object
OfficeLocation     object
dtype: object

 data types for inner join df:
 ID                  int64
Name               object
Age               float64
Salary              int64
Role               object
OfficeLocation     object
dtype: object

In [19]:
# Change age column to integer
left_join_df['Age'] = left_join_df['Age'].astype(int)
inner_join_df['Age'] = inner_join_df['Age'].astype(int)

In [20]:
#STEP 5

left_join_df = left_join_df.sort_values(by='Salary', ascending=False)
inner_join_df = inner_join_df.sort_values(by='Salary', ascending=False)

In [21]:
#STEP 6
left_join_df

   ID     Name  Age  Salary       Role OfficeLocation
3   4    David   45   90000   Director        Chicago
5   6    Frank   45   85000        NaN            NaN
6   7    Grace   38   80000        NaN            NaN
2   3  Charlie   32   80000    Analyst    Los Angeles
1   2      Bob   35   75000    Manager  San Francisco
8  10     Jack   34   72000        NaN            NaN
4   5      Eva   28   70000  Assistant         Boston
7   9      Ivy   29   65000        NaN            NaN
0   1    Alice   28   60000   Engineer       New York

In [22]:
inner_join_df

   ID     Name  Age  Salary       Role OfficeLocation
3   4    David   45   90000   Director        Chicago
2   3  Charlie   32   80000    Analyst    Los Angeles
1   2      Bob   35   75000    Manager  San Francisco
4   5      Eva   28   70000  Assistant         Boston
0   1    Alice   28   60000   Engineer       New York

# **Challenge Task 3**

1. **Merge the Tables**
   - Merge `challenge_3_dataset` with `transformers_feeders` to add the `Feeder` column.
   - Merge the result with `feeders_suburbs` to add the `Suburb` column.

2. **Data Cleaning**
   - Identify and handle missing values 

3. **Pivot Table Analysis**
   - Create a pivot table that shows, for each `Suburb`, the average `SolarSize`, average `BatterySize`, and the count of NMIs with at least one technology (`HasSolar`, `HasEV`, or `HasBESS` is True).

4. **Extra Analysis**
   - For each transformer, find the `NMI` that has the largest `SolarSize`. 

5. **Feature Engineering**
   - Create a new column `"CERCount"` that counts how many Customer Energy Resources (solar, EV, BESS) each NMI has.
   - Create another column `"CERCombo"` that describes the combination (e.g., `"Solar+EV"`, `"EV"`, `"BESS"`, `"None"`).

In [8]:
challenge_3_df.head()

,NMI,Transformer,InstallationDate,HasSolar,HasEV,HasBESS,SolarSize,EVmodel,BatterySize
0,NMI000000,Transformer_048,2017-01-14,True,False,False,5.2,No EV,0.0
1,NMI000001,Transformer_038,2013-10-04,False,False,False,0.0,No EV,0.0
2,NMI000002,Transformer_023,2019-08-05,True,False,True,9.1,No EV,14.8
3,NMI000003,Transformer_031,2014-11-02,False,False,True,0.0,No EV,16.7
4,NMI000004,Transformer_025,2014-12-23,True,True,False,9.1,Hyundai Ioniq,0.0

In [9]:
transformers_feeders.head()

       Transformer      Feeder
0  Transformer_001  Feeder_002
1  Transformer_002  Feeder_013
2  Transformer_003  Feeder_001
3  Transformer_004  Feeder_003
4  Transformer_005  Feeder_001

In [10]:
feeders_suburbs.head()

       Feeder        Suburb
0  Feeder_001        Petrie
1  Feeder_002        Petrie
2  Feeder_003  Albany Creek
3  Feeder_004        Petrie
4  Feeder_005   Eatons Hill

#### 1. Merge the Tables

In [2]:
# 1. Merge the tables
merged = challenge_3_df.merge(transformers_feeders, on='Transformer', how='left')
merged = merged.merge(feeders_suburbs, on='Feeder', how='left')

In [3]:
print("Sum of Missing Values")
merged.isnull().sum()

Sum of Missing Values

NMI                 5648
Transformer         6928
InstallationDate    5449
HasSolar            5895
HasEV               4683
HasBESS             4603
SolarSize           4665
EVmodel             5015
BatterySize         6933
Feeder              6928
Suburb              6928
dtype: int64

#### 2. Data Cleaning
In some cases we might be able to determine the `NMI`, `Transformer`, `Feeder` and/or `Suburb` values by looking at other data sources. For example we could visually look at GIS applications like ViewEQ, or we could load in another dataset. For this example we do not have access to any of this. Also, we are using FAKE data, so these tools would not be helpful anyways. Therefore, we will just drop rows missing values in these columns.

In [4]:
# - Drop rows with missing NMI, Transformer, Feeder, or Suburb (critical columns)
merged = merged.dropna(subset=['NMI', 'Transformer', 'Feeder', 'Suburb'])


Sometimes we can populate empty values with the most accurate assumption. For example, if a customer has a `SolarSize` value, but no `HasSolar` value, then we can make the conclusion that the actual `HasSolar` value is `True`. This discrepancy may have been caused by human error during the data collection stage. The best way to find the cause of errors is to ask. If you know how the error was caused in the first place, then you can be more certain of how to reverse the error. 

We can also achieve a similar thing if we know the customer has solar  (`HasSolar` = True) but no `SolarSize` value. However, choosing the best method to fill the missing values can get complicated quickly. Some possible methods include:
- Mean of all solar systems in the dataset.
- Mean of solar systems on the same Transformer, Feeder or Suburb.
- Mode of all solar systems, on that Transformer, Feeder or Suburb.

In all cases the dataset will become biased and skewed. Therefore, we will just drop the rows. The same is true for the `BatterySize`, `EVmodel` and `InstallationDate` columns.

In [5]:
# --- Fix boolean columns based on feature columns ---
# If HasSolar is None but SolarSize > 0, set HasSolar to True
mask_solar = merged['HasSolar'].isnull() & (merged['SolarSize'] > 0)
merged.loc[mask_solar, 'HasSolar'] = True

# If HasEV is None but EVmodel is set (not None/'None'), set HasEV to True
mask_ev = merged['HasEV'].isnull() & (merged['EVmodel'] != 'None')
merged.loc[mask_ev, 'HasEV'] = True

# If HasBESS is None but BatterySize > 0, set HasBESS to True
mask_bess = merged['HasBESS'].isnull() & (merged['BatterySize'] > 0)
merged.loc[mask_bess, 'HasBESS'] = True


# We can fill the remaining missing booleans with False
for col in ['HasSolar', 'HasEV', 'HasBESS']:
    merged[col] = merged[col].fillna(False)

# Drop rows with missing values in all the other columns
merged_clean = merged.dropna(subset=['SolarSize','BatterySize','EVmodel','InstallationDate'])

C:\Users\gb191\AppData\Local\Temp\ipykernel_22892\260351185.py:17: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  merged[col] = merged[col].fillna(False)

In [6]:
print("Sum of Missing Values")
merged_clean.isnull().sum()

Sum of Missing Values

NMI                 0
Transformer         0
InstallationDate    0
HasSolar            0
HasEV               0
HasBESS             0
SolarSize           0
EVmodel             0
BatterySize         0
Feeder              0
Suburb              0
dtype: int64

In [7]:
merged_clean.head()

,NMI,Transformer,InstallationDate,HasSolar,HasEV,HasBESS,SolarSize,EVmodel,BatterySize,Feeder,Suburb
0,NMI000000,Transformer_033,2020-05-12,True,True,True,9.8,Tesla Model 3,13.8,Feeder_001,Albany Creek
1,NMI000001,Transformer_012,2016-09-25,False,True,True,0.0,Tesla Model 3,5.7,Feeder_018,Brendale
2,NMI000002,Transformer_013,2017-12-22,False,False,True,0.0,No EV,8.0,Feeder_005,Albany Creek
3,NMI000003,Transformer_024,2013-03-20,False,True,True,0.0,Tesla Model 3,10.4,Feeder_003,Strathpine
4,NMI000004,Transformer_047,2011-06-03,False,True,False,0.0,No EV,0.0,Feeder_009,Strathpine

#### 3. Pivot Table Analysis
We can use the `.any()` function to create a new column that determines if the customer has at least one of the three technologies. We can then use this in the Pivot Table.

Pivot Tables can be very confusing to wrap your head around. The best tip we can give you is that the `index` parameter sets the row-wise index values, the `values` parameter sets the values in the table and the column headers. Optionally you can chosoe the `columns`parameter to set the column headers. If in doubt, try different configurations of parameters and display the results so you can play around with what works and what doesn't.

In [9]:

# - Count NMIs with at least one technology (HasSolar, HasEV, HasBESS is True)
merged_df = merged_clean.copy()
merged_df['HasAnyTech'] = merged_df[['HasSolar', 'HasEV', 'HasBESS']].any(axis=1)

pivot = merged_df.pivot_table(
    index='Suburb',
    values=['SolarSize', 'BatterySize', 'HasAnyTech'],
    aggfunc={'SolarSize':'mean', 'BatterySize':'mean', 'HasAnyTech':'sum'}
).rename(columns={'HasAnyTech':'TechCount'})

print("--- Pivot Table Analysis ---")
print(pivot)

--- Pivot Table Analysis ---
              BatterySize  TechCount  SolarSize
Suburb
Albany Creek     6.201025      25953   3.003071
Brendale         5.955139       1158   2.849962
Eatons Hill      6.258041      15878   2.977932
Petrie           6.236694      11136   3.037377
Strathpine       6.349347       7449   2.985833

#### 4. Extra Analysis
There are many ways we can achieve this. Below is just one way.

In [10]:
# For each transformer, find the NMI that has the largest SolarSize
idxmax_solar = merged_df.groupby('Transformer')['SolarSize'].idxmax()

largest_solar = merged_df.loc[idxmax_solar][['Transformer', 'NMI', 'SolarSize']].sort_values('Transformer')

print("--- Largest SolarSize per Transformer ---")
print(largest_solar)

--- Largest SolarSize per Transformer ---
           Transformer        NMI  SolarSize
14403  Transformer_001  NMI014403       10.0
22993  Transformer_002  NMI022993       10.0
18446  Transformer_003  NMI018446       10.0
51778  Transformer_004  NMI051778       10.0
14782  Transformer_005  NMI014782       10.0
71     Transformer_006  NMI000071       10.0
11331  Transformer_007  NMI011331       10.0
20775  Transformer_008  NMI020775       10.0
30671  Transformer_009  NMI030671       10.0
33873  Transformer_010  NMI033873       10.0
11573  Transformer_011  NMI011573       10.0
29392  Transformer_012  NMI029392       10.0
49085  Transformer_013  NMI049085       10.0
28612  Transformer_014  NMI028612       10.0
1802   Transformer_015  NMI001802       10.0
3904   Transformer_016  NMI003904       10.0
22861  Transformer_017  NMI022861       10.0
40533  Transformer_018  NMI040533       10.0
32099  Transformer_019  NMI032099       10.0
25228  Transformer_020  NMI025228       10.0
26577  Transformer_021  NMI026577       10.0
11709  Transformer_022  NMI011709       10.0
78550  Transformer_023  NMI078550       10.0
46128  Transformer_024  NMI046128       10.0
16519  Transformer_025  NMI016519       10.0
6519   Transformer_026  NMI006519       10.0
32754  Transformer_027  NMI032754       10.0
58144  Transformer_028  NMI058144       10.0
7237   Transformer_029  NMI007237       10.0
24333  Transformer_030  NMI024333       10.0
19327  Transformer_031  NMI019327       10.0
37628  Transformer_032  NMI037628       10.0
20308  Transformer_033  NMI020308       10.0
3884   Transformer_034  NMI003884       10.0
24509  Transformer_035  NMI024509       10.0
24173  Transformer_036  NMI024173       10.0
50695  Transformer_037  NMI050695       10.0
1315   Transformer_038  NMI001315       10.0
25459  Transformer_039  NMI025459       10.0
29227  Transformer_040  NMI029227       10.0
8174   Transformer_041  NMI008174       10.0
22569  Transformer_042  NMI022569       10.0
19943  Transformer_043  NMI019943       10.0
8759   Transformer_044  NMI008759       10.0
858    Transformer_045  NMI000858       10.0
8470   Transformer_046  NMI008470       10.0
5428   Transformer_047  NMI005428       10.0
52040  Transformer_048  NMI052040       10.0
25390  Transformer_049  NMI025390       10.0
48136  Transformer_050  NMI048136       10.0

#### 5. Feature Engineering

To set the CER combination for each NMI we will use the [.apply()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.apply.html) function. This function allows you to parse a custom function to each row in the dataframe.

In [14]:
# - CERCount: How many CERs per NMI
merged_df['CERCount'] = merged_df[['HasSolar', 'HasEV', 'HasBESS']].sum(axis=1)

# - CERCombo: What combination of CERs does each NMI have?
def combo(row):
    combo_list = []
    if row['HasSolar']:
        combo_list.append('Solar')
    if row['HasEV']:
        combo_list.append('EV')
    if row['HasBESS']:
        combo_list.append('BESS')
    return '+'.join(combo_list) if combo_list else 'None'
merged_df['CERCombo'] = merged_df.apply(combo, axis=1)

print("--- Feature Engineering Examples ---")
print(merged_df[['NMI', 'CERCount', 'CERCombo']])

--- Feature Engineering Examples ---
             NMI  CERCount    CERCombo
50908  NMI050908         2  Solar+BESS
50906  NMI050906         2     EV+BESS
50904  NMI050904         2  Solar+BESS
99953  NMI099953         2    Solar+EV
99950  NMI099950         2    Solar+EV
...          ...       ...         ...
99971  NMI099971         2     EV+BESS
99991  NMI099991         2     EV+BESS
99992  NMI099992         2     EV+BESS
99999  NMI099999         2    Solar+EV
49199  NMI049199         2     EV+BESS

[26476 rows x 3 columns]